In [3]:
import pandas as pd

In [21]:
df1 = pd.DataFrame({
    'Item': ['A', 'B', 'C'],
    'Price': [10,20,30] 
})
df2 = pd.DataFrame({
    'Item': ['D', 'E', 'F'],
    'Price': [40,50,60] 
})
df3 = pd.DataFrame({
    'Country': ['X','Y','Z'],
    'Available': [True, True, False] 
})
df4 = pd.DataFrame({
    'Item': ['B', 'C', 'D'],
    'Country': ['X','Y','Z']
})

In [10]:
pd.concat([df1,df2]). reset_index().drop('index', axis = 1)

  Item  Price
0    A     10
1    B     20
2    C     30
3    D     40
4    E     50
5    F     60

In [15]:
pd.concat([df1, df3], axis = 1)

  Item  Price Country  Available
0    A     10       X       True
1    B     20       Y       True
2    C     30       Z      False

In [23]:
pd.merge(df1, df4, how = 'outer')
# pd.merge(df1, df4, how = 'inner')
#pd.merge(df1, df4, how = 'left # right')

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z